# Fictitious Names

### Intro:

На этот раз мы все будем делать ручками

Спасибо [Chris Albon](http://chrisalbon.com/) за все (датасет и материалы). Это все его)

Если вы не особо знакомы с джойнами в пандасе - не страшно, сейчас разберемся, освежите память как работают джойны в SQL [here](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/).


https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html


### Step 1. Все как обычно

In [1]:
import pandas as pd
import numpy as np

### Step 2. Создайте 3 DataFrame на основе данных ниже и положите в переменные data1, data2, data3

In [2]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': [ '4', '5', '7', '8', '11'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [4]:
data1 = pd.DataFrame(data=raw_data_1)

In [5]:
data1

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [6]:
data2 = pd.DataFrame(data=raw_data_2)

In [8]:
data2

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          7       Bran   Balwner
3          8      Bryce     Brice
4         11      Betty    Btisan

In [9]:
data3 = pd.DataFrame(data=raw_data_3)

In [10]:
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 3. Объедините data1 и data2 вдоль строк и сохарните в переменную all_data

hint: concat, add, обратите внимание на параметр ignore_index.

In [24]:
all_data = pd.concat([data1, data2], ignore_index=True, axis=0)

In [25]:
all_data

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
5          4      Billy    Bonder
6          5      Brian     Black
7          7       Bran   Balwner
8          8      Bryce     Brice
9         11      Betty    Btisan

In [21]:
assert all_data.shape == (10, 3)

### Step 4. Объедините data1, data2 вдоль колонок и сохраните в all_data_col

In [26]:
all_data_col = pd.concat([data1,data2], axis=1)

In [27]:
all_data_col

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          7       Bran   Balwner
3          4      Alice      Aoni          8      Bryce     Brice
4          5     Ayoung   Atiches         11      Betty    Btisan

In [28]:
assert all_data_col.shape == (5, 6)

### Step 5. Объедините all_data и data3 по полю subject_id и сохраните в all_data_merged

In [32]:
all_data_merged = pd.merge(all_data, data3, on="subject_id")

In [33]:
all_data_merged

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7       Bran   Balwner       14
8          8      Bryce     Brice       15
9         11      Betty    Btisan       16

In [34]:
assert all_data_merged.shape==(10, 4)

### Step 6. Объедините data1, data2. Нужно оставить только те записи, где  'subject_id' встречается в обоих DF. Сохраните в переменную AAA

In [38]:
AAA = pd.merge(data1, data2, on="subject_id", how="inner")

In [39]:
AAA

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

In [36]:
assert AAA.shape == (2, 5)

### Step 7. Объедините data1, data2 по 'subject_id', сматчив записи с обоих датафреймов, где это возможно, и оставив информацию с обоих датафреймов где не сматчилось. (на какой вид SQL мерджа это похоже? Найдите такой парамер и используйте во благо). Сохраните датафрейм в переменную BBB

In [40]:
BBB = pd.merge(data1,data2,on="subject_id",how="outer")

In [41]:
assert BBB.shape == (8, 5)

In [42]:
BBB

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          7          NaN         NaN         Bran     Balwner
6          8          NaN         NaN        Bryce       Brice
7         11          NaN         NaN        Betty      Btisan

In [43]:
# Обратите внимание у вас могли появиться у названий колонок суффиксы _x и _y.
# это сделано для того чтобы понимать откуда какая запись пришла. Вы можете задать их любыми.
# (например _df1, _df2)